'''
Καταμέτρηση ελληνικών γραμμάτων σε ένα κείμενο. 
'''

text = """
Αποστολή του Τμήματος είναι η παροχή εκπαίδευσης, τεχνογνωσίας και εξειδίκευσης υψηλού επιπέδου, 
καθώς και η ανάπτυξη επιστημονικής και τεχνολογικής έρευνας σε αναδυόμενους τομείς της Πληροφορικής 
και των Τηλεπικοινωνιών, με σκοπό τη δημιουργία στελεχών υψηλού επιστημονικού επιπέδου. 
Η δισδιάστατη προσέγγιση των αντικειμένων της Πληροφορικής και των Τηλεπικοινωνιών, επιτρέπει 
την δημιουργία επαγγελματιών με υψηλή εξειδίκευση και ελκυστικότητα στην αγορά εργασίας
"""

GREEK_CAPS = "ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ"

a_dict = {}
for c in GREEK_CAPS:
    a_dict[c] = 0

for c in text:
    c = c.upper()
    if c not in GREEK_CAPS:
        continue
    a_dict[c] += 1

for c in GREEK_CAPS:
    print(f"Γράμμα = {c} εμφανίσεις = {a_dict[c]}")
