'''
Καταμέτρηση ελληνικών γραμμάτων σε ένα κείμενο. 
'''

text = """
Αποστολή του Τμήματος είναι η παροχή εκπαίδευσης, τεχνογνωσίας και εξειδίκευσης υψηλού επιπέδου, 
καθώς και η ανάπτυξη επιστημονικής και τεχνολογικής έρευνας σε αναδυόμενους τομείς της Πληροφορικής 
και των Τηλεπικοινωνιών, με σκοπό τη δημιουργία στελεχών υψηλού επιστημονικού επιπέδου. 
Η δισδιάστατη προσέγγιση των αντικειμένων της Πληροφορικής και των Τηλεπικοινωνιών, επιτρέπει 
την δημιουργία επαγγελματιών με υψηλή εξειδίκευση και ελκυστικότητα στην αγορά εργασίας
"""

GREEK_CAPS = "ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ"

a_dict = {}
for c in GREEK_CAPS:
    a_dict[c] = 0

for c in text:
    c = c.upper()
    if c not in GREEK_CAPS:
        continue
    a_dict[c] += 1

for c in GREEK_CAPS:
    print(f"Γράμμα = {c} εμφανίσεις = {a_dict[c]}")

# Γράμμα = Α εμφανίσεις = 27
# Γράμμα = Β εμφανίσεις = 0
# Γράμμα = Γ εμφανίσεις = 10
# Γράμμα = Δ εμφανίσεις = 10
# Γράμμα = Ε εμφανίσεις = 32
# Γράμμα = Ζ εμφανίσεις = 0
# Γράμμα = Η εμφανίσεις = 26
# Γράμμα = Θ εμφανίσεις = 1
# Γράμμα = Ι εμφανίσεις = 35
# Γράμμα = Κ εμφανίσεις = 21
# Γράμμα = Λ εμφανίσεις = 12
# Γράμμα = Μ εμφανίσεις = 12
# Γράμμα = Ν εμφανίσεις = 26
# Γράμμα = Ξ εμφανίσεις = 3
# Γράμμα = Ο εμφανίσεις = 28
# Γράμμα = Π εμφανίσεις = 19
# Γράμμα = Ρ εμφανίσεις = 12
# Γράμμα = Σ εμφανίσεις = 32
# Γράμμα = Τ εμφανίσεις = 29
# Γράμμα = Υ εμφανίσεις = 16
# Γράμμα = Φ εμφανίσεις = 2
# Γράμμα = Χ εμφανίσεις = 4
# Γράμμα = Ψ εμφανίσεις = 3
# Γράμμα = Ω εμφανίσεις = 7